[
    {
        "title": "Chicken Marinara with Mushrooms",
        "description": "A rich mushroom sauce tops this quick chicken and pasta dinner",
        "display_src": "../data/img/1.jpg",
        "ingredients": [
            "12 ounces dried linguine or spaghetti",
            "4 cloves garlic, minced",
            "2 tablespoons lower-fat margarine",
            "1 pound skinless, boneless chicken breast halves, cut into thin bite-size strips",
            "1/2 teaspoon dried chervil, crushed",
            "1/2 teaspoon dried basil, crushed",
            "1/4 teaspoon dried thyme, crushed",
            "6 ounces fresh mushrooms, sliced",
            "1 27 1/2 ounce jar light spaghetti sauce",
            "1/2 cup dry white wine",
            "2 teaspoons sugar (optional)"
        ],
        "steps": [
            "Cook pasta according to package directions; drain and keep warm. Meanwhile, in a large skillet cook garlic in hot margarine for 30 seconds. Add half of the chicken and half of each of the herbs. Cook and stir for 3 to 4 minutes or until chicken is no longer pink. Remove chicken, reserving drippings in skillet. Repeat with the remaining chicken and herbs.",
            "Add mushrooms to drippings in skillet. Cook and stir about 3 minutes or until tender. Add spaghetti sauce, wine, and, if desired, sugar. Return chicken to skillet; heat through. Serve over the hot pasta. Makes 6 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": []
    },
    {
        "title": "Sage Chicken Dumpling Soup",
        "description": "A delicious weeknight meal, try this homey recipe that uses fresh mushrooms, chicken, olives, and sage.",
        "display_src": "../data/img/2.jpg",
        "ingredients": [
            "2 cups sliced fresh mushrooms",
            "1 cup chopped onions",
            "1 tablespoon olive oil",
            "1/4 cup all-purpose flour",
            "6 cups reduced-sodium chicken broth",
            "1/2 teaspoon dried basil, crushed",
            "1/4 teaspoon dried thyme, crushed",
            "1 2 pound deli-roasted chicken, skinned, boned, and cut in chunks",
            "2 cups frozen peas",
            "1/2 cup pitted kalamata olives, halved",
            "1 tablespoon lemon juice",
            "1 teaspoon ground sage",
            "1 recipe Buttermilk Dumplings Thinly sliced green onion (optional) Fried Sage Leaves (optional)"
        ],
        "steps": [
            "In 4-quart Dutch oven cook mushrooms and onions in hot oil over medium heat 6 to 8 minutes until liquid has evaporated. Stir in flour until combined. Add broth all at once; cook and stir until thickened and bubbly. Stir in chicken, peas, olives, lemon juice, and sage. Return to boiling.",
            "Prepare Buttermilk Dumpling dough; drop dough, 1/3 cup at a time, onto boiling soup. Simmer, covered, 10 minutes or until toothpick inserted near centers comes out clean. To serve sprinkle with green onion and Fried Sage Leaves."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Cold Coffee",
        "description": "A delicious summer cold coffee, that uses beer, vodka, chilled, lemon.",
        "display_src": "../data/img/3.jpg",
        "ingredients": [
            "5 cups strong brewed coffee, chilled",
            "4 cups root beer, chilled",
            "3/4 - 1 cup Jagermeister liqueur or anise liqueur, such as sambuca",
            "1/2 cup vodka",
            "1/2 cup half-and-half, chilled (optional) Lemon peel twists"
        ],
        "steps": [
            "Pour 4 cups of the chilled coffee into two ice cube trays. Freeze about 3 hours or until firm. In a large pitcher combine the remaining 1 cup chilled coffee, the root beer, liqueur, and vodka. Cover and chill until needed.",
            "To serve, add the coffee ice cubes from one tray to root beer mixture. Pour root beer mixture into small glasses over the remaining coffee ice cubes. Drizzle with half-and-half (if desired) and garnish with lemon peel twists."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Coffee Smoothie",
        "description": "That Will Make You A Much More Pleasant Morning Person",
        "display_src": "../data/img/4.jpg",
        "ingredients": [
            "1 teaspoon instant espresso coffee powder",
            "1 tablespoon hot water",
            "1 small banana, peeled, cut up, and frozen",
            "1/4 cup fat-free milk",
            "1 tablespoon honey",
            "1/2 cup Ice cubes",
            "Ground cinnamon, optional"
        ],
        "steps": [
            "In a blender combine espresso powder and hot water; let stand 1 minute. Add banana, milk, and honey. Cover and blend until smooth. Gradually add ice blending to desired consistency. Sprinkle lightly with cinnamon."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Spicy Coffee",
        "description": "Serve this orange-scented coffee hot or over ice",
        "display_src": "../data/img/5.jpg",
        "ingredients": [
            "4 cups brewed coffee",
            "2 inches stick cinnamon",
            "1/2 teaspoon whole allspice",
            "2 2x1/2-inch strips orange peel",
            "Stick cinnamon (optional)"
        ],
        "steps": [
            "In a medium saucepan combine coffee, 2 inches stick cinnamon, allspice, and orange peel. Bring to boiling; reduce heat. Cover and simmer for 5 minutes.",
            "Remove solids from coffee with a slotted spoon. Pour coffee into coffee cups. If desired, garnish with cinnamon sticks."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Orange-Spiced Coffee",
        "description": "Spiked with orange liqueur, this nicely spiced brew can be served hot or cold. And it's low in calories!",
        "display_src": "../data/img/6.jpg",
        "ingredients": [
            "1/4 - 1/3 cup ground coffee beans",
            "1/2 teaspoon ground cinnamon",
            "1/8 teaspoon ground allspice",
            "1/8 teaspoon ground cloves",
            "2 tablespoons orange liqueur",
            "2 tablespoons light cream (optional)",
            "2 tablespoons brown sugar (optional)"
        ],
        "steps": [
            "Place a coffee filter in coffee filter basket of 10-cup drip electric coffeemaker. Combine ground beans, cinnamon, allspice, and cloves in coffee filter.",
            "Fill carafe with water. Prepare coffee according to coffeemaker directions. Stir in orange liqueur and, if desired, light cream and/or brown sugar. If desired, garnish each serving with orange wedges. Serve the drinks immediately. Makes 8 (6-ounce) servings.",
            "Cool coffee at room temperature, covered, 2 hours. Serve over ice. If desired, stir light cream and/or brown sugar into coffee before serving."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Cinnamon Coffee",
        "description": "A perfectly easy way to spice up your morning, or perhaps your afternoon, and add some indulgence to your cup of Joe.",
        "display_src": "../data/img/7.jpg",
        "ingredients": [
            "5 cups hot, brewed strong coffee",
            "1/4 cup sugar",
            "4 inches stick cinnamon",
            "1/3 cup half-and-half or light cream",
            "Whipped cream (optional)",
            "Ground cinnamon (optional)"
        ],
        "steps": [
            "In the pot of an electric drip coffeemaker combine hot brewed coffee, sugar, and stick cinnamon. Let stand for 10 minutes on the warming element.",
            "Divide coffee mixture among six mugs. Stir about 1 tablespoon of the half-and-half into each mug of coffee. If desired, top with whipped cream and ground cinnamon."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Breakfast Blintzes",
        "description": "Plan a brunch around these delightful ricotta-filled crepes made with the season's fresh berries.",
        "display_src": "../data/img/8.jpg",
        "ingredients": [
            "1 egg",
            "1 1/2 cups skim milk",
            "1 cup all-purpose flour",
            "Nonstick cooking spray",
            "1/2 teaspoon shortening",
            "1 15 ounce carton low-fat or light ricotta cheese",
            "2 tablespoons orange marmalade",
            "1 tablespoon sugar",
            "1/8 teaspoon ground cinnamon",
            "2/3 cup light dairy sour cream",
            "5 tablespoons orange marmalade",
            "1/2 cup fresh raspberries or blueberries"
        ],
        "steps": [
            "For crepes, in a medium bowl combine egg, milk, and flour. Beat with rotary beater until well mixed. Spray an unheated 6-inch skillet or crepe pan with nonstick cooking spray. Preheat skillet over medium heat. Remove from heat and pour in about 2 tablespoons batter. Lift and tilt skillet to spread batter. Return skillet to heat; cook 30 to 60 seconds or until browned on 1 side only. Remove from pan. Repeat with remaining batter to make 15 crepes. Lightly brush skillet with shortening between cooking, as needed.",
            "Spray a shallow baking pan with nonstick cooking spray. Set aside. For filling, in a bowl combine ricotta cheese, the 2 tablespoons orange marmalade, the sugar, and cinnamon. Spoon about 2 tablespoons filling onto the unbrowned side of a crepe; spread out slightly. Fold in half. Fold in half again, forming a wedge. Arrange in prepared pan. Repeat with remaining filling and crepes.",
            "Bake in a 350 degree F oven for 15 to 20 minutes or until heated through. To serve, spoon 2 teaspoons of sour cream and 1 teaspoon of marmalade onto each blintz. Sprinkle with berries. Makes 15 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Cinnamon Breakfast Muffins",
        "description": "These muffins are dipped in melted butter then a yummy combination of cinnamon and sugar before serving warm as a wonderful brunch treat.",
        "display_src": "../data/img/9.jpg",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "1/2 cup sugar",
            "1 1/2 teaspoons baking powder",
            "1/4 teaspoon ground nutmeg",
            "1/8 teaspoon salt",
            "1 egg",
            "1/2 cup milk",
            "1/3 cup butter or margarine, melted",
            "1/4 cup sugar",
            "1/2 teaspoon ground cinnamon",
            "1/4 cup butter or margarine, melted"
        ],
        "steps": [
            "Preheat oven to 350F. Grease twelve 2-1/2-inch muffin cups; set aside.",
            "In a medium bowl stir together flour, the 1/2 cup sugar, the baking powder, nutmeg, and salt. Make a well in the center of the flour mixture. In a small bowl beat egg with a fork; stir in milk and the 1/3 cup melted butter. Add egg mixture to flour mixture all at once. Stir just until moistened (batter will be lumpy).",
            "Spoon batter into prepared muffin cups. Bake in the preheated oven for 20 to 25 minutes or until a wooden toothpick inserted in centers comes out clean.",
            "Meanwhile, combine the 1/4 cup sugar and the cinnamon. Cool muffins in muffin cups on a wire rack for 5 minutes. Remove from muffin cups. Dip muffins into the 1/4 cup melted butter, then into sugar-cinnamon mixture. Serve warm. Makes 12 muffins."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Breakfast Wraps",
        "description": "This take on lox and cream cheese uses whole wheat tortillas instead of the traditional bagels.",
        "display_src": "../data/img/10.jpg",
        "ingredients": [
            "1/3 cup light cream cheese spread",
            "1 tablespoon snipped fresh chives",
            "1 teaspoon finely shredded lemon peel",
            "1 tablespoon lemon juice",
            "4 6 - 7 - inches whole wheat flour tortillas",
            "3 ounces thinly sliced, smoked salmon (lox-style), cut into strips",
            "1 small zucchini, trimmed",
            "Lemon wedges (optional)"
        ],
        "steps": [
            "In a small bowl, stir together cream cheese, chives, lemon peel, and lemon juice until smooth. Spread evenly over tortillas, leaving a 1/2-inch border around the edges.",
            "Divide salmon among tortillas, placing it on the bottom half of each tortilla. To make zucchini ribbons, draw a sharp vegetable peeler lengthwise along the zucchini to cut very thin slices. Place zucchini ribbons on top of salmon. Starting from the bottom, roll up tortillas. Cut in half. If desired, serve with lemon wedges."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Spinach-Apricot Salad",
        "description": "Make this side dish salad into a main dish or low calorie lunch by adding grilled chicken.",
        "display_src": "../data/img/11.jpg",
        "ingredients": [
            "8 cups torn fresh prewashed baby spinach",
            "1/3 cup dried apricots, snipped",
            "1 tablespoon olive oil",
            "1 clove garlic, thinly sliced or minced",
            "4 teaspoons balsamic vinegar",
            "Salt",
            "Freshly ground black pepper",
            "2 tablespoons slivered almonds, toasted"
        ],
        "steps": [
            "Remove stems from spinach, if desired. In a large bowl combine spinach and apricots; set aside.",
            "In a 12-inch skillet heat oil over medium heat. Cook and stir garlic in hot oil until golden. Stir in the balsamic vinegar. Bring to boiling; remove from heat.",
            "Add the spinach-apricot mixture to skillet. Return to heat and toss mixture in skillet about 1 minute or until spinach is just wilted.",
            "Transfer mixture to a serving dish. Season to taste with salt and pepper. Sprinkle with almonds. Serve salad immediately. Makes 4 side-dish servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Lemony Italian Salad",
        "description": "Serve this large salad when entertaining. It would go well with grilled meats.",
        "display_src": "../data/img/12.jpg",
        "ingredients": [
            "2/3 cup dry brown lentils",
            "1 1/3 cups water",
            "5 plum tomatoes, chopped (about 1-3/4 cups)",
            "3/4 cup finely shredded Parmesan cheese (3 ounces)",
            "3/4 cup finely shredded Asiago cheese (3 ounces)",
            "2 cups baby fresh spinach leaves or torn fresh spinach",
            "1/2 pound thinly sliced prosciutto or ham (about 12 slices)",
            "1/3 cup vinegar",
            "1/3 cup olive oil",
            "2 tablespoons lemon juice",
            "1 tablespoon Dijon-style mustard",
            "2 teaspoons snipped fresh rosemary",
            "1/4 teaspoon salt",
            "1/8 teaspoon pepper"
        ],
        "steps": [
            "Rinse lentils; place in a small saucepan with the water. Bring to boiling; reduce heat. Cover and simmer for 20 to 25 minutes or just until tender. Drain and chill for 1 to 2 hours or until thoroughly chilled.",
            "Arrange the tomatoes, cheeses, spinach, cooked lentils, and prosciutto or ham on a large serving platter or in a serving dish.",
            "For dressing, in a screw-top jar combine vinegar, olive oil, lemon juice, mustard, rosemary, salt, and pepper. Cover and shake well. Drizzle over salad. Makes 8 to 10 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Pear-Blue Cheese Salad",
        "description": "Use slightly firm pears for this recipe. The fruit should give a little under thumb pressure and be juicy when you cut into them.",
        "display_src": "../data/img/13.jpg",
        "ingredients": [
            "1 recipe Holiday Dijon Vinaigrette (see www.bhg.com) or 3/4 cup favorite purchased vinaigrette",
            "2 tablespoons butter",
            "1 cup pecan halves",
            "1 tablespoon sugar",
            "1/8 teaspoon salt",
            "16 cups torn curly endive (chicory), romaine lettuce, or spinach",
            "3 ripe pears, cored and thinly sliced",
            "1 cup crumbled blue cheese"
        ],
        "steps": [
            "Prepare Holiday Dijon Vinaigrette. In a large skillet melt butter over medium heat. Add pecan halves. Cook 4 to 5 minutes or until pecans are lightly toasted, stirring frequently. Sprinkle sugar and salt over pecans; cook and stir for 1 minute more. Transfer pecans to a medium bowl; cool.",
            "In a 6- to 8-quart salad bowl combine curly endive, pears, blue cheese, and half the pecans. Pour Holiday Vinaigrette over salad. Toss gently to coat. Divide among salad plates. Sprinkle with remaining pecans. Makes 8 to 10 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Guacamole Salad",
        "description": "This fresh vegetable and rice salad has a heart-healthy avocado dressing.",
        "display_src": "../data/img/14.jpg",
        "ingredients": [
            "3 cups cooked basmati rice",
            "1 large tomato, seeded and chopped (2/3 cup)",
            "3/4 cup chopped sweet onion (such as Vidalia or Walla Walla)",
            "3 tablespoons snipped fresh cilantro",
            "3 tablespoons lemon juice",
            "2 - 3 tablespoons seeded and finely chopped fresh jalapeno pepper*",
            "2 tablespoons olive oil",
            "1/2 teaspoon salt",
            "1/4 teaspoon pepper",
            "1 avocado, halved, seeded, peeled, and chopped",
            "2 tablespoons lime juice",
            "Shredded romaine lettuce",
            "Lime wedges"
        ],
        "steps": [
            "In a large bowl combine rice, tomato, onion, cilantro, lemon juice, jalapeno pepper, oil, salt, and pepper. Toss avocado with lime juice; stir into rice mixture. Cover and chill 2 to 8 hours.",
            "Spoon mixture on top of shredded romaine lettuce. Serve with lime wedges. Makes 6 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Blueberry-Sour Cream Dessert",
        "description": "A cross between a pie and a cheesecake. Use fresh blueberries when in season. Frozen blueberries work too in this summer-fresh dessert recipe.",
        "display_src": "../data/img/15.jpg",
        "ingredients": [
            "1 recipe Dessert Crust",
            "3 cups fresh or frozen blueberries",
            "1/3 cup sugar",
            "3 tablespoons quick-cooking tapioca",
            "1/4 cup water",
            "1 teaspoon ground cinnamon",
            "1 teaspoon finely shredded lemon peel",
            "1/4 teaspoon ground nutmeg",
            "2 1/2 cups dairy sour cream",
            "3 egg yolks, slightly beaten",
            "1/2 cup sugar",
            "1 teaspoon vanilla",
            "Fresh blueberries (optional)"
        ],
        "steps": [
            "Prepare and bake Dessert Crust. Reduce oven temperature to 350 degrees F. In a medium saucepan, combine 3 cups blueberries, the 1/3 cup sugar, the tapioca, water, cinnamon, lemon peel, and nutmeg. Let stand for 15 minutes. Cook and stir mixture over medium heat until blueberries become juicy and mixture is bubbly. Turn into partially baked Dessert Crust.",
            "In a medium mixing bowl, combine sour cream, egg yolks, the 1/2 cup sugar, and the vanilla. Pour evenly over blueberry mixture.",
            "Bake about 50 minutes or until sour cream layer is set when gently shaken. Cool in pan on a wire rack for 1 hour. With a sharp knife, loosen crust from side of pan; remove side. Cover and chill overnight before serving.",
            "To serve, if desired, garnish with additional blueberries. Makes 12 to 16 slices."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Strawberry Chiffon Dessert",
        "description": "Light whipped topping and egg whites create an airy texture in this easy low-fat dessert. Use the make ahead directions when time is short.",
        "display_src": "../data/img/16.jpg",
        "ingredients": [
            "3 cups whole fresh strawberries",
            "1/4 cup sugar or sugar substitute* equivalent to 1/4 cup sugar",
            "1 envelope unflavored gelatin",
            "3 egg whites, slightly beaten",
            "1 3 ounce package ladyfingers, split",
            "2 tablespoons orange juice",
            "1/2 8 ounce container frozen light whipped dessert topping, thawed",
            "Sliced fresh strawberries (optional)",
            "Fresh mint leaves (optional)"
        ],
        "steps": [
            "Line bottom of a 9- or 9-1/2-inch tart pan with a removable bottom or a 9-inch springform pan with parchment paper; set aside. In a blender or food processor, blend or process the 3 cups strawberries until smooth. Measure 1-3/4 cups of the pureed strawberries (puree additional strawberries if needed to measure 1-3/4 cups).",
            "In a medium saucepan, combine sugar (if using) and gelatin. Stir in the pureed strawberries; let stand for 5 minutes to soften gelatin. Cook and stir over medium heat until the mixture bubbles and the gelatin is dissolved.",
            "Gradually stir about half of the gelatin mixture into the egg whites. Return all of the mixture to the saucepan. Cook, stirring constantly, over low heat for 2 to 3 minutes or until slightly thickened. Do not boil. Strain mixture into a medium bowl. Stir in sugar substitute (if using). Chill for 1-1/2 to 2 hours or just until the mixture mounds when dropped from a spoon, stirring occasionally.",
            "Meanwhile, cut about half of the split ladyfingers in half crosswise; stand these on end around the outside edge of prepared pan. Arrange the remaining split ladyfingers in bottom of pan (ladyfingers may not completely cover bottom of pan). Slowly drizzle the orange juice over the ladyfingers.",
            "Fold whipped topping into strawberry mixture; spread into the ladyfinger-lined pan. Cover and chill about 2 hours or until set.",
            "To serve, if desired, garnish with additional berries and mint leaves. Makes 10 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Apple-Cranberry Dessert",
        "description": "A sweet batter tops a layer of fresh apples and cranberries in this delicious dessert casserole.",
        "display_src": "../data/img/17.jpg",
        "ingredients": [
            "2 12 ounce package fresh or frozen cranberries or 2 16-ounces packages frozen unsweetened pitted tart red cherries*",
            "2 cups chopped, peeled cooking apples",
            "2 tablespoons butter, cut up",
            "1 1/4 cups sugar",
            "3/4 cup chopped walnuts or pecans",
            "2 eggs, slightly beaten",
            "3/4 cup butter, melted",
            "1 cup sugar",
            "3/4 cup all-purpose flour",
            "Vanilla ice cream"
        ],
        "steps": [
            "Preheat oven to 325 degree F. Grease the bottom of a 13x9x2-inch baking pan. Toss the cranberries and apples together in the pan. Dot cranberry mixture with the 2 tablespoons butter. Sprinkle evenly with the 1-1/4 cups sugar and the chopped nuts.",
            "In a medium mixing bowl whisk together the eggs, melted butter, the 1 cup sugar, and the flour until well combined. Pour evenly over top of cranberry mixture.",
            "Bake, uncovered, for 1 to 1-1/4 hours or until top is golden brown. Serve warm (cool about 30 minutes) or at room temperature with vanilla ice cream. Makes 15 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Spring Chicken Salad",
        "description": "Loaded with fresh fruits and vegetables, this easy chicken salad is so delicious your family won't realize how good it is for them.",
        "display_src": "../data/img/18.jpg",
        "ingredients": [
            "1 2 pound purchased whole roasted chicken",
            "4 cups coarsley chopped fruit, such as peeled and cored pineapple, peeled and seeded mango, and/or peeled kiwifruit",
            "2 cups coarsely chopped, peeled jicama",
            "2 tablespoons thinly sliced green onion",
            "1/2 cup mayonnaise or salad dressing",
            "1/2 teaspoon finely shredded lime peel",
            "2 tablespoons lime juice",
            "1 clove garlic, minced",
            "2 teaspoons Jamaican jerk seasoning or Mediterranean or Greek seasoning or 1 teaspoon Thai seasoning",
            "1/4 teaspoon salt",
            "Bibb lettuce",
            "2 cups mesclun salad greens, cut into bite-size pieces",
            "Pea shoots or watercress (optional)"
        ],
        "steps": [
            "Remove meat from roasted chicken. Coarsely chop (you should have about 3 cups). Discard skin, if desired, and bones.",
            "In a very large bowl combine chicken, pineapple (or other fruit), jicama, and green onion; set aside.",
            "For dressing, in a small bowl combine mayonnaise, lime peel, lime juice, garlic, seasoning, and salt. Spoon about half the dressing over chicken mixture; toss to coat well.",
            "Line 4 individual serving plates with Bibb lettuce. Add mesclun mix to each plate. Arrange some of the chicken mixture on each plate. Top with pea shoots. Drizzle with some of the remaining dressing. Makes 6 to 8 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Chickpea Salad",
        "description": "During peak tomato season, the dressing for this side salad needs just a smidge of sugar. If your tomatoes are a little on the tart side, you might want to add more sugar.",
        "display_src": "../data/img/19.jpg",
        "ingredients": [
            "3 cups coarsely chopped tomatoes (about 4 medium)",
            "1 15 ounce can garbanzo beans (chickpeas), rinsed and drained",
            "1/2 of a large cucumber, peeled, quartered, and sliced (about 1 cup)",
            "1 cup chopped green sweet pepper",
            "1 cup snipped fresh cilantro",
            "1/4 cup finely chopped onion",
            "1/4 cup olive oil",
            "3 tablespoons red wine vinegar",
            "1 teaspoon coarse kosher salt",
            "1 clove garlic, minced",
            "1/8 teaspoon sugar",
            "Torn mixed salad greens (optional)",
            "Lemon wedges (optional)"
        ],
        "steps": [
            "In a very large bowl combine tomatoes, garbanzo beans, cucumber, sweet pepper, cilantro, and onion; set aside.",
            "For dressing, in a screw-top jar combine oil, vinegar, salt, garlic, and sugar. Cover and shake well. Season to taste with additional sugar, if desired. Pour dressing over vegetable mixture, tossing to coat. Cover and chill 4 to 24 hours.",
            "Let vegetable mixture stand at room temperature about 15 minutes before serving. Serve alone or toss with mixed greens as a light entree. Serve with lemon wedges to squeeze over salad. Makes 8 to 10 side-dish servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Caesar Salad",
        "description": "This is the classic of all salads, with ingredients like romaine, garlic, and parmesan cheese. Add chicken for a main dish variation.",
        "display_src": "../data/img/20.jpg",
        "ingredients": [
            "3 cloves garlic",
            "3 anchovy fillets",
            "3 tablespoons lemon juice",
            "3 tablespoons olive oil",
            "1 tablespoon Dijon-style mustard",
            "1/2 teaspoon Worcestershire sauce",
            "1 hard cooked egg yolk",
            "1 clove garlic, halved",
            "10 cups torn romaine",
            "1 Parmesan Croutons or 2 cups purchased garlic Parmesan croutons",
            "1/4 cup grated Parmesan cheese or 1/2 cup Parmesan curls",
            "Freshly ground black pepper"
        ],
        "steps": [
            "For dressing, in a blender or food processor combine the 3 garlic cloves, the anchovy fillets, and lemon juice. Cover and blend or process until mixture is nearly smooth, stopping to scrape down sides as needed. Add oil, mustard, Worcestershire sauce, and cooked egg yolk. Cover and blend or process until smooth. Cover surface with plastic wrap; chill for 2 to 24 hours.",
            "To serve, rub inside of a wooden salad bowl with cut edges of halved garlic clove; discard garlic clove. Add romaine and croutons to bowl. Pour dressing over salad.; toss lightly to coat. Sprinkle Parmesan cheese over top; toss gently. To serve, divide salad among salad plates; sprinkle pepper over each salad. Makes 6 side-dish servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Peach-Berry Frozen Dessert",
        "description": "Using fat-free cheese and yogurt plus light dessert topping help keep this chilled fruit dessert recipe low in calories, carbs, and fat.",
        "display_src": "../data/img/21.jpg",
        "ingredients": [
            "1 8 - ounce package fat-free cream cheese, softened",
            "2 6 - ounce carton peach fat-free yogurt with artificial sweetener",
            "1/2 8 - ounce container frozen light whipped dessert topping, thawed",
            "1 cup chopped, peeled fresh peaches; frozen unsweetened peach slices, thawed, drained, and chopped; or one 8-1/4-ounce can peach slices (juice pack), drained and chopped",
            "1 cup fresh or frozen unsweetened blueberries, raspberries, and/or strawberries, thawed and drained if frozen",
            "Fresh mint leaves (optional)",
            "Fresh berries (optional)"
        ],
        "steps": [
            "In a medium bowl, combine cream cheese and yogurt. Beat with an electric mixer on medium speed until smooth. Fold in the whipped topping, peaches, and the 1 cup berries.",
            "Pour into a 2-quart square baking dish. Cover with foil and freeze about 8 hours or until firm",
            "To serve, let stand at room temperature about 45 minutes to thaw slightly. Cut into squares. If desired, garnish with mint leaves and additional berries. Makes 9 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Red, White and Blueberry Ice Cream Dessert",
        "description": "Raspberry sorbet, vanilla ice cream, and a flavored syrup create this summer dessert.",
        "display_src": "../data/img/22.jpg",
        "ingredients": [
            "2 pints raspberry sorbet, softened",
            "2 pints vanilla ice cream, softened",
            "1 recipe Hibiscus Syrup",
            "Additional blueberries (optional)"
        ],
        "steps": [
            "Line two 8x4x2-inch loaf pans with foil, extend foil over pan edges; set aside. Spoon 1 pint of raspberry sorbet in each prepared pan; spread evenly. Cover and freeze 1 to 2 hours or until firm. One-half hour before spreading second layer, allow vanilla ice cream to soften 30 minutes in refrigerator. Spoon 1 pint softened vanilla ice cream on raspberry sorbet in each pan. Cover; freeze 4 hours or overnight until ice cream is firm. Place serving platter in freezer.",
            "To serve, remove ice cream loaves from pans, using foil to lift. Peel back foil and slice each loaf in 8 slices. Place slices on frozen serving platter. Serve with Hibiscus Syrup. Or scatter the additional blueberries over slices. Makes 16 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Chocolate Chunk Blondies",
        "description": "These cakelike bars are just like brownies, only blond, hence the name. The added chocolate provides extra decadence.",
        "display_src": "../data/img/23.jpg",
        "ingredients": [
            "2/3 cup butter",
            "2 cups packed brown sugar",
            "2 eggs",
            "2 teaspoons vanilla",
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1/4 teaspoon baking soda",
            "3/4 cup chopped semisweet or white baking chocolate",
            "3/4 cup sliced almonds or chopped pecans, or cashews"
        ],
        "steps": [
            "Preheat oven to 350 degrees F. Grease a 13x9x2-inch baking pan; set aside. In a medium saucepan heat and stir butter and brown sugar over medium heat until smooth. Cool slightly. Stir in eggs, one at a time. Stir in vanilla. Stir in flour, baking powder, and baking soda. Stir in chopped chocolate.",
            "Spread batter evenly in the prepared pan. Sprinkle with almonds. Bake for 25 to 30 minutes or until a wooden toothpick inserted in the center comes out clean. Cool slightly in pan on a wire rack. Cut into bars while warm. Makes 36 bars."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Breakfast Pita Pizza",
        "description": "Lots of vegetables, protein-packed tofu, and reduced-fat cheddar cheese top a crispy pita crust for a super-duper breakfast pizza for people with diabetes.",
        "display_src": "../data/img/24.jpg",
        "ingredients": [
            "1 teaspoon olive oil",
            "1/2 cup sliced fresh mushrooms",
            "1/2 cup chopped red or green sweet pepper",
            "3 ounces firm tub-style tofu (fresh bean curd), drained and crumbled (about 1/2 cup)",
            "1 green onion, thinly sliced",
            "1 clove garlic, minced",
            "1/8 teaspoon ground black pepper",
            "1 whole wheat pita bread round, split in half horizontally",
            "1/2 cup shredded reduced-fat cheddar cheese (2 ounces)"
        ],
        "steps": [
            "Preheat oven to 375 degrees F. Line a baking sheet with parchment paper; set aside. In a medium skillet, heat oil over medium heat. Add mushrooms and sweet pepper to skillet; cook for 5 to 8 minutes or until tender, stirring occasionally. Stir in tofu, green onion, garlic, and black pepper.",
            " Place pita halves, cut sides down, on prepared baking sheet. Sprinkle with 1/4 cup of the cheese. Top with mushroom mixture. Sprinkle with the remaining 1/4 cup cheese. Bake for 8 to 10 minutes or until heated through and cheese is melted."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Breakfast Rice Cereal",
        "description": "Make brown rice the headliner in this hot cereal that's studded with dried fruit bits.",
        "display_src": "../data/img/25.jpg",
        "ingredients": [
            "1 1/2 cups water",
            "1/8 teaspoon salt",
            "1 cup quick-cooking brown rice",
            "1/3 cup mixed dried fruit bits",
            "3/4 cup skim milk",
            "Dash ground nutmeg",
            "2 - 3 tablespoons brown sugar"
        ],
        "steps": [
            "In a 2-quart saucepan bring water and salt to boiling; add rice and dried fruit bits. Cover and simmer 12 to 14 minutes or until rice is tender and liquid is absorbed. Stir in milk and nutmeg. Heat through. Serve with brown sugar. Makes 4 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Apple Breakfast Bars",
        "description": "This no-bake cookie bar is great for a snack or breakfast on the go.",
        "display_src": "../data/img/26.jpg",
        "ingredients": [
            "1/2 cup dried apples, snipped",
            "1/3 cup honey",
            "1/4 cup raisins",
            "1 tablespoon brown sugar",
            "1/3 cup peanut butter",
            "1/4 cup apple butter",
            "1/2 teaspoon ground cinnamon",
            "1/2 cup rolled oats",
            "1/2 cup chopped walnuts or pecans",
            "1/3 cup toasted wheat germ",
            "1/4 cup roasted sunflower seeds",
            "2 cups cornflakes and/or wheat flakes"
        ],
        "steps": [
            "In a Dutch oven combine dried apples, honey, raisins, and brown sugar. Heat and stir until mixture boils; reduce heat slightly. Cook, uncovered, for 1 minute, stirring constantly. Remove from heat. Stir in peanut butter until melted. Stir in apple butter and cinnamon. Stir in rolled oats, walnuts or pecans, wheat germ, and sunflower seeds until well combined. Add cereal, stirring to coat.",
            "Press mixture very firmly (or bars will crumble) and evenly into an ungreased 8x8x2-inch pan. Chill to set. Cut into 8 bars. Store in an airtight container in the refrigerator up to 2 days. Makes 8 bars."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Spiced Breakfast Popovers",
        "description": "Sweet and sensational, the strawberries in one serving of this luscious breakfast supply 75 percent of your vitamin C needs for the day.",
        "display_src": "../data/img/27.jpg",
        "ingredients": [
            "Nonstick cooking spray",
            "1 egg",
            "1/3 cup fat-free milk",
            "1 teaspoon cooking oil",
            "1/3 cup all-purpose flour",
            "Dash salt",
            "1 recipe Orange Cream (see below)",
            "1 cup coarsely chopped strawberries",
            "Orange peel strips (optional)",
            "Powdered sugar (optional)"
        ],
        "steps": [
            "For popovers, generously coat the bottoms and sides of two 6-ounce custard cups with nonstick cooking spray. Place the custard cups in a shallow baking pan; set aside.",
            "In a small bowl combine egg, milk, and oil. Beat with a wire whisk or rotary beater. Add flour and salt; beat until smooth. Pour batter into prepared custard cups, filling each half full. Bake in a 400 degree F oven about 35 minutes or until popovers are firm.",
            "Remove popovers from oven and immediately prick each popover with a fork to let steam escape. (For crisper popovers, turn off oven; return popovers to the oven for 5 to 10 minutes or until desired crispness is reached.) Remove popovers from cups.",
            "To serve, split warm popovers open at the tops; top with Orange Cream and strawberries. If desired, garnish with orange peel strips and powdered sugar. Makes 2 popovers."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Smoked Salmon Breakfast Wraps",
        "description": "This take on lox and cream cheese uses whole wheat tortillas instead of the traditional bagels.",
        "display_src": "../data/img/28.jpg",
        "ingredients": [
            "1/3 cup light cream cheese spread",
            "1 tablespoon snipped fresh chives",
            "1 teaspoon finely shredded lemon peel",
            "1 tablespoon lemon juice",
            "4 6 - 7 - inches whole wheat flour tortillas",
            "3 ounces thinly sliced, smoked salmon (lox-style), cut into strips",
            "1 small zucchini, trimmed",
            "Lemon wedges (optional)"
        ],
        "steps": [
            "In a small bowl, stir together cream cheese, chives, lemon peel, and lemon juice until smooth. Spread evenly over tortillas, leaving a 1/2-inch border around the edges.",
            "Divide salmon among tortillas, placing it on the bottom half of each tortilla. To make zucchini ribbons, draw a sharp vegetable peeler lengthwise along the zucchini to cut very thin slices. Place zucchini ribbons on top of salmon. Starting from the bottom, roll up tortillas. Cut in half. If desired, serve with lemon wedges."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Breakfast Buttered Potatoes",
        "description": "Rely on potatoes for a filling dish. These quick-fix herbed potatoes are a great addition to a brunch buffet or as a side dish.",
        "display_src": "../data/img/29.jpg",
        "ingredients": [
            "12 small red potatoes (about 3 pounds)",
            "1/4 cup butter or margarine",
            "1 tablespoon snipped fresh rosemary or 1 teaspoon dried rosemary, crushed (optional)",
            "1/2 teaspoon salt",
            "1/4 teaspoon pepper"
        ],
        "steps": [
            "Scrub potatoes thoroughly with a stiff brush. Cut potatoes into quarters. Cook potatoes in a 4-quart Dutch oven in a small amount of boiling, lightly salted water for 15 to 20 minutes or until tender; drain.",
            "Meanwhile, heat butter or margarine in a small skillet over low heat until melted. Stir in the rosemary, if using, salt, and pepper. If using rosemary, cook and stir over low heat for 2 minutes. Gently toss cooked potatoes in a bowl with the butter mixture until potatoes are coated. Makes 12 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Steak Salad",
        "description": "This main-dish salad is a great way to use leftover steak or roast beef.",
        "display_src": "../data/img/30.jpg",
        "ingredients": [
            "1/2 cup bottled fat-free red wine vinegar salad dressing",
            "1 tablespoon snipped fresh tarragon or 1/2 teaspoon dried tarragon, crushed",
            "1/2 teaspoon cracked or coarsely ground pepper",
            "2 heads Boston lettuce, separated into leaves",
            "1/2 pound lean cooked beef, cut into thin bite-size strips",
            "1 cup red or yellow baby pear tomatoes or cherry tomatoes",
            "1 cup broccoli florets",
            "1/2 medium red onion, cut into thin slices",
            "1/4 cup crumbled blue cheese (1 ounce)",
            "1/2 cup fat-free croutons"
        ],
        "steps": [
            "For dressing, combine bottled red wine vinegar salad dressing, tarragon, and pepper, set aside. (Or, prepare your favorite homemade vinaigrette.)",
            "To serve, line 4 dinner plates with lettuce leaves. Arrange beef, tomatoes, broccoli, and onion on plates. Sprinkle with blue cheese. Drizzle with dressing and top with croutons. Makes 4 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Ravioli Salad",
        "description": "Use purchased Italian salad dressing and toss with ravioli, broccoli, carrots, and pea pods to make this salad. Other reduced-calorie dressings work also.",
        "display_src": "../data/img/31.jpg",
        "ingredients": [
            "1 9 - ounce package refrigerated light cheese ravioli",
            "3 cups broccoli florets",
            "1 cup sliced carrots",
            "2 green onions, sliced (1/4 cup)",
            "1/2 cup bottled reduced-calorie Italian salad dressing or balsamic vinaigrette",
            "1 large tomato, chopped",
            "1 cup fresh pea pods, halved crosswise",
            "8 lettuce leaves (optional)"
        ],
        "steps": [
            "Cook ravioli according to package directions, except omit any oil or salt. Add broccoli and carrots the last 3 minutes of cooking time (return to boiling after vegetables are added and then finish cooking). Drain. Rinse with cold running water; drain again.",
            "In a large bowl combine, pasta mixture and green onions; drizzle with dressing. Toss to coat. Cover and chill for 2 to 6 hours.",
            "To serve, gently stir tomato and pea pods into salad. If desired, serve on lettuce leaves. Makes 8 (1-cup) side-dish servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Chocolate-Coffee Liqueur",
        "description": "This homemade liqueur makes a delightful holiday gift. Tie a pretty bow around the bottle and include a card with the recipe.",
        "display_src": "../data/img/32.jpg",
        "ingredients": [
            "1/2 cup packed dark-brown sugar",
            "1/2 cup granulated sugar",
            "1/4 cup unsweetened cocoa powder",
            "1 1/3 cups freshly brewed strong coffee (brewed with 1/4 cup finely ground espresso coffee beans and 1-1/2 cups water)",
            "3/4 cup vodka",
            "1/2 cup brandy",
            "20 whole espresso coffee beans",
            "1/2 vanilla bean, partially split"
        ],
        "steps": [
            "Combine brown sugar, granulated sugar and cocoa powder in small saucepan. Stir in coffee. Bring to boiling; remove from heat. Transfer to heatproof jar with tight-fitting lid. Let stand 3 days, shaking 2 or 3 times each day.",
            "Line sieve or colander with wet paper toweling; place over medium-size bowl. Shake coffee-cocoa mixture; slowly pour into lined colander. Let drip 24 hours or until liquid has run through (you should have about 1-1/4 cups of liquid).",
            "Add vodka and brandy to filtered coffee mixture; pour into pretty liqueur bottle. Add espresso beans and vanilla bean to bottle. Cover tightly; let stand at least 3 days before serving. Serve in small cordial glasses."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Hot Coffee Latte Eggnog",
        "description": "You make your own eggnog, spiked with a little Kahlua, for this holiday drink.",
        "display_src": "../data/img/33.jpg",
        "ingredients": [
            "3 eggs, slightly beaten",
            "2 cups whole milk",
            "1 cup whipping cream",
            "1/2 cup coffee liqueur",
            "2 tablespoons honey",
            "1 tablespoon instant espresso coffee powder or 4 teaspoons instant coffee crystals",
            "Whipped cream (optional)",
            "Ground cinnamon",
            "8 long cinnamon sticks (optional)"
        ],
        "steps": [
            "In a heavy large saucepan, stir together the eggs, milk, whipping cream, Kahlua, honey and espresso coffee powder. Cook and stir over medium heat until mixture just coats a metal spoon; do not let boil. (Should take 20 to 25 minutes and register 170 degrees F to 175 degrees F on instant-read thermometer.",
            "Pour the hot eggnog into heatproof glasses or coffee cups. Top with whipped cream, if you like. Sprinkle each with ground cinnamon and, if you like, serve with cinnamon sticks. Serve immediately. Makes 8 (4-ounce) servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Raspberry-Coffee Frappe",
        "description": "Raspberry-flavor syrup heightens the taste in this coffee-spiked ice cream drink.",
        "display_src": "../data/img/34.jpg",
        "ingredients": [
            "2 cups strong coffee, chilled",
            "1/4 cup raspberry-flavored syrup",
            "1/2 cup half-and-half or light cream",
            "18 ice cubes (about 2-1/2 cups)",
            "6 scoops coffee-flavor ice cream",
            "Chocolate shavings (optional)"
        ],
        "steps": [
            "Place 1 cup of the coffee, the raspberry-flavor syrup, the half-and-half or light cream, and the ice cubes in a blender container. Cover and blend until the ice is finely crushed. Add the remaining coffee. Cover and blend on the lowest speed just until combined.",
            "To serve, pour the coffee mixture into glasses. Top each glass with a scoop of coffee-flavor ice cream and, if desired, chocolate shavings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Anise Coffee and Ice Cream",
        "description": "Ice cream melts quickly to mellow steaming-hot coffee. Mimic the idea for kids by using hot chocolate instead of coffee.",
        "display_src": "../data/img/35.jpg",
        "ingredients": [
            "1/3 cup ground dark roast coffee",
            "2 teaspoons anise seeds, crushed",
            "2 1/4 cups cold water",
            "1 vanilla ice cream"
        ],
        "steps": [
            "Measure coffee and anise seeds into a filter-lined coffeemaker basket. Pour water into water compartment. Place pot on heating element; let water drip through basket into pot.",
            "Meanwhile, carefully cut ice cream from package and cut into 8 long pieces. Place ice cream into cups. Pour about 1/4 cup of coffee around ice cream. Serve immediately. Makes 8 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    },
    {
        "title": "Chocolate Almond Coffee Granita",
        "description": "Cocoa powder, coffee, and almond extract flavor this low-fat, low-calorie frozen dessert recipe. Serve it to finish brunch or dinner or as a refreshing snack.",
        "display_src": "../data/img/36.jpg",
        "ingredients": [
                        "2 cups water",
                        "1/2 cup sugar",
                        "1 tablespoon unsweetened cocoa powder",
                        "2 teaspoons instant coffee crystals",
                        "Several drops almond extract"
        ],
        "steps": [
            "In a small bowl combine the water, sugar, cocoa powder, coffee crystals, and almond extract. Stir until sugar and cocoa are dissolved. Pour the mixture into an 8x4x2-inch or a 9x5x3-inch loaf pan. Cover and freeze, about 6 hours or until solid.",
            "With a large spoon or fork, break the frozen mixture into coarse ice crystals. Return to freezer for 1 to 2 hours more. Stir again, working quickly to break granita into finer ice crystals. This step may be repeated at 30-minute intervals until desired consistency is reached or freeze overnight.",
            "Spoon into individual dessert glasses. Serve immediately. Makes about 2 cups or 4 servings."
        ],
        "likes": 0,
        "likePositive": 0,
        "comments": [ ]
    }

]
